src/Documents/уатПрочиеДоходыРасходы/уатПрочиеДоходыРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уатПрочиеДоходыРасходы</name>
  <basedOn>Document.уатОтчетСистемыПлатон</basedOn>
  <basedOn>Document.уатПарковка</basedOn>
  <basedOn>Document.уатСписаниеТоваров</basedOn>
  <basedOn>Document.уатРемонтныйЛист</basedOn>
  <basedOn>Document.уатОтчетСистемыАвтодор</basedOn>
  <registerRecords>AccumulationRegister.уатРасходы</registerRecords>
  <registerRecords>AccumulationRegister.уатДоходы</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <comment>Вид операции</comment>
    <type>
      <types>EnumRef.уатВидыОперацийПрочиеДоходыРасходы</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Колонна</name>
    <type>
      <types>CatalogRef.уатКолонны</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <comment>Валюта документа</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>Сумма в валюте документа, налоги включены согласно флагам</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьНДС</name>
    <comment>Учитывать НДС</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <comment>Сумма включает НДС</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Документ основание</comment>
    <type>
      <types>DocumentRef.уатПарковка</types>
      <types>DocumentRef.уатОтчетСистемыПлатон</types>
      <types>DocumentRef.уатРемонтныйЛист</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Расходы</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>ДатаОтражения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.уатСтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТС</name>
      <type>
        <types>CatalogRef.уатТС</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.уатЗаказГрузоотправителя</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>Сумма в валюте регл. учета</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <comment>Ставка НДС</comment>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <comment>Сумма НДС в валюте регл. учета</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатрат</name>
      <comment>(Регл)</comment>
      <type>
        <types>ChartOfAccountsRef.уатРегламентированный</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатурнаяГруппа</name>
      <comment>(Упр)</comment>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектСтроительства</name>
      <type>
        <types>CatalogRef.уатОбъектыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>Маршрут</name>
      <type>
        <types>CatalogRef.уатМаршруты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПеревозки</name>
      <type>
        <types>CatalogRef.уатВидыПеревозок</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеПеревозки</name>
      <type>
        <types>CatalogRef.уатНаправленияПеревозок</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Доходы</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>ДатаОтражения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДоходов</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.уатСтатьиДоходов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТС</name>
      <type>
        <types>CatalogRef.уатТС</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.уатЗаказГрузоотправителя</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>Сумма в валюте регл. учета</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <comment>Ставка НДС</comment>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <comment>Сумма НДС в валюте регл. учета</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектСтроительства</name>
      <type>
        <types>CatalogRef.уатОбъектыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>Маршрут</name>
      <type>
        <types>CatalogRef.уатМаршруты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПеревозки</name>
      <type>
        <types>CatalogRef.уатВидыПеревозок</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеПеревозки</name>
      <type>
        <types>CatalogRef.уатНаправленияПеревозок</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/уатПартииТоваровНаСкладах/уатПартииТоваровНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>уатПартииТоваровНаСкладах</name>
  <comment>Партии товаров на складах  (уат)</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <comment>Стоимость в валюте регламентированного учета без НДС</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьУпр</name>
    <comment>Стоимость в валюте управленческого учета без НДС</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <comment>Сумма НДС в регл. валюте</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.уатОприходованиеТоваров</types>
      <types>DocumentRef.уатОперацииСТехническимиЖидкостями</types>
      <types>DocumentRef.уатПоступлениеТоваровУслуг</types>
      <types>DocumentRef.уатСливГСМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/уатВидыОперацийПрочиеДоходыРасходы/уатВидыОперацийПрочиеДоходыРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатВидыОперацийПрочиеДоходыРасходы</name>
  <enumValues>
    <name>Доходы</name>
  </enumValues>
  <enumValues>
    <name>Расходы</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>НДС20</name>
    <comment>(Общ) Ставка НДС 20%</comment>
  </enumValues>
  <enumValues>
    <name>НДС20_120</name>
    <comment>(Общ) Расчетная ставка НДС 20% / 120%</comment>
  </enumValues>
  <enumValues>
    <name>НДС18</name>
    <comment>(Общ) Ставка НДС 18%</comment>
  </enumValues>
  <enumValues>
    <name>НДС18_118</name>
    <comment>(Общ) Расчетная ставка НДС 18% / 118%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <comment>(Общ) Ставка НДС 10%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10_110</name>
    <comment>(Общ) Расчетная ставка НДС 10% / 110%</comment>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <comment>(Общ) Ставка НДС 0%</comment>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

src/Enums/уатСпособыРемонта/уатСпособыРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатСпособыРемонта</name>
  <comment>(уат)</comment>
  <enumValues>
    <name>Автосервис</name>
  </enumValues>
  <enumValues>
    <name>РемЗона</name>
  </enumValues>
</mdclass:Enum>

src/Documents/уатСписаниеТоваров/уатСписаниеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уатСписаниеТоваров</name>
  <comment>(уат)</comment>
  <basedOn>Document.уатИнвентаризацияТоваров</basedOn>
  <registerRecords>AccumulationRegister.уатПартииТоваровНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.уатТоварыВЯчейках</registerRecords>
  <registerRecords>InformationRegister.уатДатыДвиженияТоваровНаСкладах</registerRecords>
  <attributes>
    <name>ИнвентаризацияТоваровНаСкладе</name>
    <comment>(Общ)</comment>
    <type>
      <types>DocumentRef.уатИнвентаризацияТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Отпустил</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Получил</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/уатПрочиеДоходыРасходы/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	Дата = ТекущаяДата();
	БазовыйДокумент = Неопределено;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	уатПроведение.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	Документы.уатПрочиеДоходыРасходы.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	уатПроведение.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	Если ВидОперации = Перечисления.уатВидыОперацийПрочиеДоходыРасходы.Доходы Тогда
		уатПроведение.ОтразитьДоходы(ДополнительныеСвойства, Движения, Отказ);
	Иначе
		уатПроведение.ОтразитьРасходы(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	уатПроведение.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	Документы.уатПрочиеДоходыРасходы.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	уатОбщегоНазначенияСервер.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатОтчетСистемыПлатон") Тогда
		ВидОперации = Перечисления.уатВидыОперацийПрочиеДоходыРасходы.Расходы;
		ДокументОснование = ДанныеЗаполнения;
		Основание = ДанныеЗаполнения;
		Подразделение = ДанныеЗаполнения.Подразделение;
		ДоговорКонтрагента = ДанныеЗаполнения.ДоговорКонтрагента;
		Организация = ДанныеЗаполнения.Организация;
		Комментарий = ДанныеЗаполнения.Комментарий;
		
		тзРасходы = ДанныеЗаполнения.Расходы.Выгрузить();
		тзРасходы.Свернуть("ТС", "СписаниеСРЗ");
		Для Каждого ТекСтрока Из тзРасходы Цикл
			НоваяСтрока = Расходы.Добавить();
			НоваяСтрока.Контрагент		 = ДанныеЗаполнения.Контрагент;
			НоваяСтрока.ТС				 = ТекСтрока.ТС;
			НоваяСтрока.Сумма			 = ТекСтрока.СписаниеСРЗ;
			НоваяСтрока.СтавкаНДС		 = Перечисления.СтавкиНДС.БезНДС;

		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатОтчетСистемыАвтодор") Тогда
		ВидОперации = Перечисления.уатВидыОперацийПрочиеДоходыРасходы.Расходы;
		ДокументОснование = ДанныеЗаполнения;
		Основание = ДанныеЗаполнения;
		Подразделение = ДанныеЗаполнения.Подразделение;
		ДоговорКонтрагента = ДанныеЗаполнения.ДоговорКонтрагента;
		Организация = ДанныеЗаполнения.Организация;
		Комментарий = ДанныеЗаполнения.Комментарий;
		
		тзРасходы = ДанныеЗаполнения.Расходы.Выгрузить();
		тзРасходы.Свернуть("ТС", "Сумма");
		Для Каждого ТекСтрока Из тзРасходы Цикл
			НоваяСтрока = Расходы.Добавить();
			НоваяСтрока.Контрагент		 = ДанныеЗаполнения.Контрагент;
			НоваяСтрока.ТС				 = ТекСтрока.ТС;
			НоваяСтрока.Сумма			 = ТекСтрока.Сумма;
			НоваяСтрока.СтавкаНДС		 = Перечисления.СтавкиНДС.БезНДС;

		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатПарковка") Тогда
		ВидОперации        = Перечисления.уатВидыОперацийПрочиеДоходыРасходы.Расходы;
		ДокументОснование  = ДанныеЗаполнения;
		Основание          = ДанныеЗаполнения;
		Подразделение      = ДанныеЗаполнения.Подразделение;
		Организация        = ДанныеЗаполнения.Организация;
		Колонна            = ДанныеЗаполнения.Колонна;

		НоваяСтрока = Расходы.Добавить();
		НоваяСтрока.ДатаОтражения	 = ДанныеЗаполнения.Запущена;
		НоваяСтрока.СтатьяРасходов	 = Справочники.уатСтатьиРасходов.Парковки;
		НоваяСтрока.ТС				 = ДанныеЗаполнения.ТС;
		НоваяСтрока.Сумма			 = ДанныеЗаполнения.ИтоговаяСтоимость;

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатСписаниеТоваров") Тогда
		
		ВидОперации       = Перечисления.уатВидыОперацийПрочиеДоходыРасходы.Расходы;
		Подразделение      = ДанныеЗаполнения.Подразделение;
		Организация        = ДанныеЗаполнения.Организация;
		ДокументОснование  = ДанныеЗаполнения;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	уатПартииТоваровНаСкладах.Стоимость КАК Стоимость
		|ИЗ
		|	РегистрНакопления.уатПартииТоваровНаСкладах КАК уатПартииТоваровНаСкладах
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатСписаниеТоваров КАК уатСписаниеТоваров
		|		ПО уатПартииТоваровНаСкладах.Регистратор = уатСписаниеТоваров.Ссылка
		|ГДЕ
		|	уатСписаниеТоваров.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		
		Материалы = Запрос.Выполнить().Выгрузить();
		
		Для Каждого текСтрока Из Материалы Цикл
			НоваяСтрока = Расходы.Добавить();
			НоваяСтрока.ДатаОтражения = ДанныеЗаполнения.Дата;
			НоваяСтрока.СтатьяРасходов = Справочники.уатСтатьиРасходов.ОсновнаяСтатьяРасходов;
			НоваяСтрока.Сумма = текСтрока.Стоимость;
			
			НоваяСтрока.СтавкаНДС = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
												ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнаяСтавкаНДС");
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатРемонтныйЛист") Тогда
		
		ВидОперации        = Перечисления.уатВидыОперацийПрочиеДоходыРасходы.Расходы;
		Подразделение      = ДанныеЗаполнения.Подразделение;
		Организация        = ДанныеЗаполнения.Организация;
		ДокументОснование  = ДанныеЗаполнения;
		
		НоваяСтрока = Расходы.Добавить();
		НоваяСтрока.ДатаОтражения	 = ДанныеЗаполнения.ДатаОкончания;
		НоваяСтрока.СтатьяРасходов	 = Справочники.уатСтатьиРасходов.Ремонты;
		НоваяСтрока.ТС				 = ДанныеЗаполнения.ТС;
		НоваяСтрока.СтавкаНДС 		 = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
					ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнаяСтавкаНДС");
		
		Если ДанныеЗаполнения.СпособРемонта = Перечисления.уатСпособыРемонта.Автосервис Тогда
			НоваяСтрока.Сумма = ДанныеЗаполнения.СуммаДокумента;
		КонецЕсли;
		
	КонецЕсли;
	
	СуммаВключаетНДС = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Организация,	"СуммаВключаетНДС");
	УчитыватьНДС = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Организация,	"УчитыватьНДС");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(ЭтотОбъект);
	уатОбщегоНазначения.ПроверкаЗаполненияПодразделения(Организация, Подразделение, Отказ, Заголовок);
КонецПроцедуры

#КонецОбласти
